brew "asdf"
brew "aspell"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bfg"
brew "bison"
brew "blueutil"
brew "circleci"
brew "cmake"
brew "colima"
brew "coreutils"
brew "cscope"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docutils"
brew "enchant"
brew "ffmpeg"
brew "fsouza/prettierd/prettierd"
brew "fx"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "gh"
brew "git"
brew "git-delta"
brew "glib"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "graphicsmagick"
brew "guile"
brew "harfbuzz"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "img2pdf"
brew "jq"
brew "just"
brew "libass"
brew "libassuan"
brew "libevent"
brew "libheif"
brew "libksba"
brew "libpng"
brew "libpq"
brew "libtool"
brew "libvterm"
brew "libxslt"
brew "libyaml"
brew "localtunnel"
brew "lucapette/tap/fakedata"
brew "luv"
brew "mas"
brew "miller"
brew "moreutils"
brew "neovim"
brew "nghttp2"
brew "node"
brew "nushell"
brew "nuttcp"
brew "ocrmypdf"
brew "openjdk"
brew "p11-kit"
brew "p7zip"
brew "pandoc"
brew "pango"
brew "pcre"
brew "perl"
brew "pgformatter"
brew "pillow"
brew "pinentry"
brew "pkgconf"
brew "pre-commit"
brew "psutils"
brew "putty"
brew "python@3.11"
brew "python@3.12"
brew "python@3.8"
brew "qpdf"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "sd"
brew "shared-mime-info"
brew "shellcheck"
brew "shfmt"
brew "shpotify"
brew "socat"
brew "srt"
brew "starship"
brew "tcl-tk"
brew "tesseract"
brew "the_silver_searcher"
brew "tree"
brew "unbound", restart_service: :changed
brew "unibilium"
brew "unixodbc"
brew "unpaper"
brew "virtualenv"
brew "wget"
brew "wxwidgets"
brew "xz"
brew "yank"
brew "zlib"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "atext"
cask "bettertouchtool"
cask "dash"
cask "datagrip"
cask "docker"
cask "firefox"
cask "flux"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "iterm2"
cask "karabiner-elements"
cask "licecap"
cask "marked"
cask "ngrok"
cask "postgres-unofficial"
cask "proton-mail-bridge"
cask "protonvpn"
cask "session-manager-plugin"
cask "signal"
cask "snowflake-snowsql"
cask "sonos"
cask "spotify"
cask "telegram"
cask "thunderbird"
cask "tresorit"
cask "wkhtmltopdf"
cask "zoom"
mas "Be Focused", id: 973134470
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "iReal Pro", id: 409035833
tap "1password/tap"
tap "fsouza/prettierd"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "lucapette/tap"
tap "neovim/neovim"
