tap "cjbassi/ytop"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jmacdonald/amp"
tap "neovim/neovim"
tap "nviennot/tmate", "https://github.com/Homebrew/brew.git"
tap "tilt-dev/tap"
tap "universal-ctags/universal-ctags"


# Automatic configure script builder
brew "autoconf"

# Tool for generating GNU Standards-compliant Makefiles
brew "automake"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Generic library support script
brew "libtool"

# YAML Parser
brew "libyaml"

# Library for command-line editing
brew "readline"

# ODBC 3 connectivity for UNIX
brew "unixodbc"

# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"

# Spell checker with better logic than ispell
brew "aspell"

# Authenticate with AWS using your Okta credentials
brew "aws-okta"

# GNU database manager
brew "gdbm"

# General-purpose data compression with high compression ratio
brew "xz"

# Official Amazon AWS command-line interface
brew "awscli"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Programmable completion for Bash 3.2
brew "bash-completion"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Development kit for the Java programming language
brew "openjdk"

# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"

# Parser generator
brew "bison"

# Get/set bluetooth power and discoverable state
brew "blueutil"

# Library for manipulating PNG images
brew "libpng"

# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"

# Portable Foreign Function Interface library
brew "libffi"

# Perl compatible regular expressions library
brew "pcre"

# Core application library for C
brew "glib"

# Interpreted, interactive, object-oriented programming language
brew "python@3.8"

# Statistics utility to count lines of code
brew "cloc"

# Tool for browsing source code
brew "cscope"

# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"

# Isolated development environments using Docker
brew "docker-compose", link: false

# Text processing system for reStructuredText
brew "docutils"

# Spellchecker wrapping library
brew "enchant"

# Command-line tool to interact with exercism.io
brew "exercism"

# Asynchronous event library
brew "libevent"

# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"

# OCR (Optical Character Recognition) engine
brew "tesseract"

# Play, record, convert, and stream audio and video
brew "ffmpeg"

# Command-line fuzzy finder written in Go
brew "fzf"

# Command-line utility for uploading Gists
brew "gist"

# Distributed revision control system
brew "git"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# GNU implementation of the famous stream editor
brew "gnu-sed"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"

# Image processing tools collection
brew "graphicsmagick"

# Framework for layout and rendering of i18n text
brew "pango"

# Graph visualization software from AT&T and Bell Labs
brew "graphviz"

# Kubernetes package manager
brew "helm"

# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"

# Add GitHub support to git on the command-line
brew "hub"

# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"

# Tools and libraries to manipulate images in many formats
brew "imagemagick"

# Istio configuration command-line utility
brew "istioctl"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Run local Kubernetes cluster in Docker
brew "kind"

# Kubernetes command-line interface
brew "kubernetes-cli"

# Postgres C API library
brew "libpq"

# Very basic terminfo library
brew "unibilium"

# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"

# GNOME XML library
brew "libxml2"

# C XSLT library for GNOME
brew "libxslt"

# Mac App Store command-line interface
brew "mas"

# High performance, distributed memory object caching system
brew "memcached", restart_service: true

# Run a Kubernetes cluster locally
brew "minikube"

# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Port scanning utility for large networks
brew "nmap"

# Network performance measurement tool
brew "nuttcp"

# Manage multiple Node.js versions
brew "nvm"

# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"

# Swiss-army knife of markup format conversion
brew "pandoc"

# Highly capable, feature-rich programming language
brew "perl"

# PostgreSQL syntax beautifier
brew "pgformatter"

# Unix pager optimized for psql
brew "pspg"

# Collection of PostScript document handling utilities
brew "psutils"

# Command-line YAML and XML processor that wraps jq
brew "python-yq"

# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"

# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Powerful, clean, object-oriented scripting language
brew "ruby"

# Intuitive find & replace CLI
brew "sd"

# Autoformat shell script source code
brew "shfmt"

# Command-line interface for Spotify on a Mac
brew "shpotify"

# Easy and Repeatable Kubernetes Development
brew "skaffold"

# SOcket CAT: netcat on steroids
brew "socat"

# Cross-shell prompt for astronauts
brew "starship"

# Tool to build, change, and version infrastructure
brew "terraform"

# Code-search similar to ack
brew "the_silver_searcher"

# Instant terminal sharing
brew "tmate"

# Terminal multiplexer
brew "tmux"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Vi 'workalike' with many additional features
brew "vim"

# Internet file retriever
brew "wget"

# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"

# Linter for YAML files
brew "yamllint"

# Copy terminal output to clipboard
brew "yank"

# JavaScript package manager
brew "yarn"

# General-purpose lossless data-compression library
brew "zlib"

# A TUI system monitor written in Rust
brew "cjbassi/ytop/ytop"

# Tilt powers multi-service developments for teams that deploy to Kubernetes.
brew "tilt-dev/tap/tilt"

# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

cask "1password"
cask "alfred"
cask "bettertouchtool"
cask "brave-browser"
cask "dash"
cask "docker"
cask "encryptme"
cask "flux"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "garmin-express"
cask "google-backup-and-sync"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "lens"
cask "lunar"
cask "marked"
cask "musescore"
cask "ngrok"
cask "slack"
cask "sonos"
cask "spotify"
cask "thunderbird"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "iReal Pro", id: 409035833
mas "Metronome X", id: 1222424189
mas "Streaks", id: 1493327990
