brew "aspell"
brew "ast-grep"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bfg"
brew "bison"
brew "blueutil"
brew "circleci"
brew "cmake"
brew "codespell"
brew "colima"
brew "coreutils"
brew "curl"
brew "d2"
brew "datadog-labs/pack/pup"
brew "direnv"
brew "docker"
brew "docutils"
brew "enchant"
brew "exiftool"
brew "expat"
brew "fd"
brew "ffmpeg"
brew "fop"
brew "fsouza/prettierd/prettierd"
brew "fx"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glib"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "graphicsmagick"
brew "guile"
brew "harfbuzz"
brew "hashicorp/tap/terraform"
brew "hoophq/brew/hoop"
brew "imagemagick"
brew "img2pdf"
brew "jira-cli"
brew "jq"
brew "just"
brew "libass"
brew "libassuan"
brew "libevent"
brew "libheif"
brew "libksba"
brew "libpng"
brew "libpq"
brew "libtool"
brew "libvterm"
brew "libxslt"
brew "libyaml"
brew "localstack/tap/localstack-cli"
brew "lucapette/tap/fakedata"
brew "luv"
brew "mas"
brew "mise"
brew "moreutils"
brew "neovim"
brew "nghttp2"
brew "node"
brew "nushell"
brew "ocrmypdf"
brew "openai-whisper"
brew "openjdk"
brew "openssl@3"
brew "p11-kit"
brew "p7zip"
brew "pandoc"
brew "pango"
brew "pcre"
brew "perl"
brew "pgformatter"
brew "pi-coding-agent"
brew "pillow"
brew "pinentry"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "pre-commit"
brew "prettier"
brew "psutils"
brew "qpdf"
brew "rclone"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "sd"
brew "shared-mime-info"
brew "shellcheck"
brew "shfmt"
brew "shpotify"
brew "snowflake-cli"
brew "socat"
brew "srt"
brew "starship"
brew "tcl-tk"
brew "tesseract"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "typst"
brew "unbound", restart_service: :changed
brew "unibilium"
brew "unixodbc"
brew "unpaper"
brew "uv"
brew "wget"
brew "worktrunk"
brew "wxwidgets"
brew "xz"
brew "yank"
brew "yt-dlp"
brew "zig"
brew "zlib"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "atext"
cask "bettertouchtool"
cask "brave-browser"
cask "claude-code"
cask "dash"
cask "datagrip"
cask "firefox"
cask "flux-app"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "homerow"
cask "iterm2"
cask "karabiner-elements"
cask "licecap"
cask "marked-app"
cask "ngrok"
cask "postgres-app"
cask "proton-mail-bridge"
cask "protonvpn"
cask "session-manager-plugin"
cask "signal"
cask "snowflake-snowsql"
cask "sonos"
cask "spotify"
cask "telegram"
cask "thunderbird"
cask "tresorit"
cask "whatsapp"
cask "wkhtmltopdf"
cask "zoom"
mas "InYourFace", id: 1476964367
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "iReal Pro", id: 409035833
npm "@earendil-works/pi-coding-agent"
npm "corepack"
tap "1password/tap", trusted: true
tap "ankitpokhrel/jira-cli", trusted: true
tap "datadog-labs/pack", trusted: true
tap "fsouza/prettierd", trusted: true
tap "hashicorp/tap", trusted: true
tap "heroku/brew", trusted: true
tap "homebrew/bundle"
tap "homebrew/services"
tap "hoophq/brew", "https://github.com/hoophq/brew", trusted: true
tap "localstack/tap", trusted: true
tap "lucapette/tap", trusted: true
tap "neovim/neovim", trusted: true
tap "snowflakedb/snowflake-cli", trusted: true
